RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense.h
* * To select values for the Scan mode and Sensor connection method parameters (for the fifth-generation of the CAPSENSE&trade; HW) 
* navigate to the Advanced tab in the CAPSENSE&trade; Configurator tool, and then select the General settings sub-tab. 
*
* * For the forth-generation of the CAPSENSE&trade; HW, the IntDrv mode with the AMUX sensor connection type is available only.
*
********************************************************************************
* \section section_capsense_misra MISRA-C:2012 Compliance
********************************************************************************
*
* This page describes MISRA-C:2012 compliance and deviations for
* the CAPSENSE&trade; middleware.
*
* MISRA stands for Motor Industry Software Reliability Association. The MISRA
* specification covers a set of 10 mandatory rules, 110 required rules and
* 39 advisory rules that apply to firmware design and has been put together
* by the Automotive Industry to enhance the quality and robustness of
* the firmware code embedded in automotive devices.
*
* \subsection subsection_capsense_misra-mw CAPSENSE&trade; Middleware Deviation
*
* <table class="doxtable">
*   <tr>
*     <th>Rule ID</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*    <tr>
*     <td>Directive  4.8</td>
*     <td>If a pointer to a structure or union is never dereferenced within a translation
*         unit, then the implementation of the object should be hidden.
*     </td>
*     <td>Advisory. The middleware library consists of several modules. One of them
*         is CapSense Data Structure. All communication between the other modules
*         is performed through CapSense Data Structure.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 2.3</td>
*     <td>A project should not contain unused type declarations.
*     </td>
*     <td>Advisory. The middleware library provides API to the hardware. The type
*         is part of API, which is defined for application-level only.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 2.5</td>
*     <td>A project should not contain unused macro declarations.
*     </td>
*     <td>Advisory. The middleware library provides API to the hardware. The macro
*         is part of API, which is defined for application-level only.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.1</td>
*     <td>External identifiers shall be distinct.
*     </td>
*     <td>Toolchains from Supported Software and Tools documentation section
*         are verified to work with functions, names of which have similar first 31 symbols.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.4</td>
*     <td>Macro identifiers shall be distinct.
*     </td>
*     <td>Toolchains from Supported Software and Tools documentation section
*         are verified to work with macros, names of which have similar first 31 symbols.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.6</td>
*     <td>A typedef name shall be a unique identifier.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All typedef names are unique for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.8</td>
*     <td>Identifiers that define objects or functions with external linkage shall be unique.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.9</td>
*     <td>Identifiers that define objects or functions with internal linkage should be unique.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.3</td>
*     <td>All declarations of an object or function shall use the same names and type qualifiers.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.5</td>
*     <td>An external object or function shall be declared once in one and only one file.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.6</td>
*     <td>An identifier with external linkage shall have exactly one external definition.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.7</td>
*     <td>Functions and objects should not be defined with external linkage if they
*         are referenced in only one translation unit.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.13</td>
*     <td>A pointer should point to const-qualified type whenever possible.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. A function argument can be const for some specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 11.5</td>
*     <td>A conversion should not be performed from pointer to void into pointer to object.
*     </td>
*     <td>Advisory. The cast from void pointer to an object pointer does not have any unintended effect,
*         as it is a consequence of the definition of a structure based on function pointers.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 14.2</td>
*     <td>A for loop shall be well-formed.
*     </td>
*     <td>The third clause of the for loop is empty to improve execution time.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 18.4</td>
*     <td>The +, -, += and -= operators should not be applied to an expression of pointer type.
*     </td>
*     <td>Advisory. There are several instances of pointer arithmetic in drivers. They cannot be avoided,
*         so are manually checked and reviewed to be safe.
*     </td>
*   </tr>
* </table>
*
* \subsection subsection_capsense_misra-cfg CAPSENSE&trade; Configurator Generated Sources Deviation
*
* <table class="doxtable">
*   <tr>
*     <th>Rule ID</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>Rule 3.1</td>
*     <td>The character sequences / * and / / shall not be used within a comment.</td>
*     <td>Using of the special comment symbols is need for Doxygen comment
*         support, it does not have any impact on functionality. </td>
*   </tr>
*   <tr>
*     <td>Rule 8.4</td>
*     <td>A compatible declaration shall be visible when an object or function with external linkage is defined.</td>
*     <td>The CAPSENSE&trade; middleware library consists of several modules. One of them is CapSense Built-in Self Test (BIST).
*         All the BIST variables are used in other data structures and accessed using pointers.</td>
*   </tr>
*   <tr>
*     <td>Rule 11.4</td>
*     <td>A conversion should not be performed between a pointer to object and an integer type.</td>
*     <td>Advisory. There are several instances of pointer conversions in Generated Source.
*         They are manually checked and reviewed to be safe.</td>
*   </tr>
* </table>
*
********************************************************************************
* \section section_capsense_errata Errata
********************************************************************************
*
* This section lists the known problems with the CAPSENSE&trade; middleware.
*
* <table class="doxtable">
*   <tr><th>ID</th><th>Known Issue</th><th>Workaround</th></tr>
*   <tr>
*     <td>319100</td>
*     <td>
*         GPIO simultaneous operation with unrestricted strength and frequency
*         creates noise that can affect CAPSENSE&trade; operation. This issue
*         is applicable for the fourth CAPSENSE&trade; generation devices.
*     </td>
*     <td>
*         For detail, refer to the errata section of the device datasheet.
*     </td>
*   </tr>
*   <tr>
*     <td>3159</td>
*     <td>
*         Scanning a sensor with low capacitance (about 8pF and less) with low
*         frequency (around 300kHz and less) might lead to raw count variation
*         from scan to scan. This issue is applicable for the fourth CAPSENSE&trade;
*         generation devices.
*     </td>
*     <td>
*         There are several possible workarounds:
*         1. Increase the Scan resolution.
*         2. Increase the Sense clock frequency. For the best results, perform
*            scanning with as high as possible Sense clock frequency.
*         3. If shield is required for a design, enable the shield tank (Csh)
*            capacitor.
*         4. Increase the sensor capacitance by changing its layout or introduce
*            extra capacitor between the sensor pin and ground.
*         5. Increase number of Fine initialization cycles. Open the cycfg_capsense.c
*            file and modify the .csdFineInitTime field of the cy_capsense_commonConfig
*            structure.
*         6. Increase the CSD init switch resistance. Open the cycfg_capsense.c file
*            and update the .csdInitSwRes field of the cy_capsense_commonConfig structure
*            with the CY_CAPSENSE_INIT_SW_RES_HIGH value.
*     </td>
*   </tr>
* </table>
*
********************************************************************************
* \section section_capsense_changelog Changelog
********************************************************************************
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="12">3.0</td>
*     <td colspan="2"><i><b>
*       This version is not backward compatible with the
*       previous version due to implemented memory consumption optimization.
*       We tried to keep the established API, but your design may need to be
*       updated to operate with CAPSENSE&trade; middleware v3.0.
*
*       Also, if you use the CAPSENSE&trade; middleware v3.0 version then
*       you must use the CAPSENSE&trade; Configurator v4.0 tool or later.
*       This MW version is not compatible with the previous Configurator tool
*       versions.
*     </b></i></td>
*   </tr>
*   <tr>
*     <td>
*     Added fifth-generation CAPSENSE&trade; device support which includes
*     but not limited:
*     * Scanning mode: DMA and Interrupt Driven
*     * Sensor connection method: Analog mux bus and Control mux bus
*     * Re-designed multi-frequency scan feature
*     * Multi-phase TX feature
*     * Improved signal-to-noise ratio
*     * Improved refresh rate
*     </td>
*     <td>New CAPSENSE&trade; MSC platform covering</td>
*   </tr>
*   <tr>
*     <td colspan="2"><i><b>The following rows show changes related to fourth-generation CAPSENSE&trade;</b></i></td>
*   </tr>
*   <tr>
*     <td>Removed usage of deprecated return error and status codes,
*         cy_status enum was replaced with the cy_capsense_status_t variable</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Removed usage of deprecated types, such as uint32 and uint16</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Changed the default IDAC gain index for the CSX auto-calibration to the configured one</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>The following functions were made obsolete:
*         * Cy_CapSense_CSDConnectSns()
*         * Cy_CapSense_CSDDisconnectSns()
*         * Cy_CapSense_CSXConnectRx()
*         * Cy_CapSense_CSXConnectTx()
*         * Cy_CapSense_CSXDisconnectRx()
*         * Cy_CapSense_CSXDisconnectTx()
*         * Cy_CapSense_CalibrateAllCsdWidgets()
*         * Cy_CapSense_CalibrateAllCsxWidgets()
*     </td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>For fourth-generation CAPSENSE&trade; devices callbacks were moved from ptrCommonContext
*         to ptrInternalContext structure</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Updated the description of the Cy_CapSense_RunSelfTest() function </td>
*     <td>Documentation defect fixing</td>
*   </tr>
*   <tr>
*     <td>Specified measurement units in the following function descriptions:
*         * Cy_CapSense_MeasureCapacitanceSensor()
*         * Cy_CapSense_MeasureCapacitanceShield()
*         * Cy_CapSense_MeasureCapacitanceCap()
*     </td>
*     <td>Documentation defect fixing</td>
*   <tr>
*     <td>Added call of the Cy_CapSense_Wakeup() function to the registered
*     callback in the Cy_CapSense_DeepSleepCallback() function</td>
*     <td>Improved robustness of a sensing module</td>
*   </tr>
*   <tr>
*     <td>Added a possibility to enable / disable independent features of
*     BIST module</td>
*     <td>Expanded flexibility</td>
*   </tr>
*   <tr>
*     <td rowspan="9">2.10</td>
*     <td>Added Built-in Self-test (BIST) library</td>
*     <td>Support Class B (IEC-60730), safety integrity-level compliant design</td>
*   </tr>
*   <tr>
*     <td>Improved the Csh and Cmod coarse initialization functionality.</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Improved the shield performance when Csh is enabled</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Fixed Cy_CapSense_ScanExt() operation</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Fixed the bug in the Cy_CapSense_SetPinState() function</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Optimized software watch-dog values used in monitoring CAPSENSE&trade;
*         scanning duration</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Improved IDAC auto-calibration</td>
*     <td>Operation accuracy increasing</td>
*   </tr>
*   <tr>
*     <td>Added the following functions:
*         * Cy_CapSense_GetParam()
*         * Cy_CapSense_SetParam()
*         * Cy_CapSense_GetCRC()
*     </td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Changed the type of context argument to const in the following
*         functions:
*         * Cy_CapSense_CSDConnectSns()
*         * Cy_CapSense_CSXConnectRx()
*         * Cy_CapSense_CSXConnectTx()
*         * Cy_CapSense_CSXDisconnectRx()
*         * Cy_CapSense_CSXDisconnectTx()
*         * Cy_CapSense_SetPinState()
*     </td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td rowspan="6">2.0</td>
*     <td>Added memory usage section to the CAPSENSE&trade; API Ref Guide</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Updated documentation</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Added the errata section to the CAPSENSE&trade; API Ref Guide</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>CAPSENSE&trade; MW sources are enclosed with the conditional compilation to
*         ensure a successful compilation for non-CAPSENSE&trade;-capable devices</td>
*     <td>Fixing a compilation error for non CAPSENSE&trade;-capable devices</td>
*   </tr>
*   <tr>
*     <td>Optimized flash memory consumption based on user's configuration</td>
*     <td>Flash foot-print optimization</td>
*   </tr>
*   <tr>
*     <td>Renamed function Cy_CapSense_CheckCommandIntegrity() to
*         Cy_CapSense_CheckTunerCmdIntegrity()</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.20</td>
*     <td>Added Arm Compiler 6 support</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Changed the hierarchy of the binary files folders</td>
*     <td>MBED OS compatibility</td>
*   </tr>
*   <tr>
*     <td rowspan="6">1.1</td>
*     <td>
*         The following functions made obsolete:
*         * Cy_CapSense_CSDSetupWidget()
*         * Cy_CapSense_CSDSetupWidgetExt()
*         * Cy_CapSense_CSDScan()
*         * Cy_CapSense_CSDScanExt()
*         * Cy_CapSense_CSDCalibrateWidget()
*         * Cy_CapSense_CSXSetupWidget()
*         * Cy_CapSense_CSXSetupWidgetExt()
*         * Cy_CapSense_CSXScan()
*         * Cy_CapSense_CSXScanExt()
*         * Cy_CapSense_CSXCalibrateWidget()
*
*         Two simple functions introduced to replace the listed above functions:
*         * Cy_CapSense_SetupWidgetExt()
*         * Cy_CapSense_ScanExt()
*     </td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Fixed the shield operation when Csh is disabled</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Fixed the implementation of the position filtering for the Radial Slider widget</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Added restoring hardware to its default state in the Cy_CapSense_DeInit() implementation</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Added the capability to enable the shield electrode without dedicated electrodes</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Added support of a protocol-agnostic tuner interface (UART, SPI, etc.)</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>
*         The initial version
*     </td>
*     <td></td>
*   </tr>
* </table>
*
********************************************************************************
* \section section_capsense_more_information More Information
********************************************************************************
*
* Important information about the CAPSENSE&trade;-technology overview, appropriate
* CYPRESS&trade; device from Infineon for the design, CAPSENSE&trade; system and sensor
* design guidelines, different interfaces and tuning guidelines necessary
* for a successful design of a CAPSENSE&trade; system is available in the Getting
* Started with CAPSENSE&trade; document and the product-specific CAPSENSE&trade; design guide.
* CYPRESS&trade; highly recommends starting with these documents. They can be
* found on the CYPRESS&trade; web site at www.cypress.com.
*
* For more information, refer to the following documents:
*
* * CAPSENSE&trade; Overview:
*
*   * <a href="https:/\/www.cypress.com/ModusToolboxCapSenseConfig"><b>ModusToolbox&trade;
*   CAPSENSE&trade; Configurator Tool Guide</b></a>
*
*   * <a href="https:/\/www.cypress.com/ModusToolboxCapSenseTuner"><b>ModusToolbox&trade;
*   CAPSENSE&trade; Tuner Tool Guide</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/application-notes/an85951-psoc-4-and-psoc-6-mcu-capsense-design-guide">
*   <b>CAPSENSE&trade; Design Guide</b></a>
*
* * ModusToolbox&trade; Overview:
*
*   * <a href="https:/\/www.cypress.com/products/modustoolbox-software-environment">
*   <b>ModusToolbox&trade; Software Environment, Quick Start Guide, Documentation,
*   and Videos</b></a>
*
*   * <a href="https:/\/www.cypress.com/ModusToolboxDeviceConfig"><b>ModusToolbox&trade;
*   Device Configurator Tool Guide</b></a>
*
* * Infineon Technologies Kits and Code Examples:
*
*   * <a href="https:/\/github.com/cypresssemiconductorco/mbed-os-example-capsense">
*   <b>CAPSENSE&trade; buttons and slider for PSoC&trade; 6 MCU with Mbed OS</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/code-examples/ce218136-psoc-6-mcu-e-ink-display-capsense-rtos">
*   <b>CAPSENSE&trade; Middleware Code Example for FreeRTOS</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/development-kitsboards/cy8ckit-145-40xx-psoc-4000s-capsense-prototyping-kit">
*   <b>CY8CKIT-145-40XX PSoC&trade; 4000S CAPSENSE&trade; Prototyping Kit</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/development-kitsboards/cy8ckit-149-psoc-4100s-plus-prototyping-kit">
*   <b>CY8CKIT-149 PSoC&trade; 4100S Plus Prototyping Kit</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/development-kitsboards/cy8ckit-041-psoc-4-s-series-pioneer-kit">
*   <b>CY8CKIT-041-40XX PSoC&trade; 4 S-Series Pioneer Kit</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/development-kitsboards/cy8ckit-041-41xx-psoc-4100s-capsense-pioneer-kit">
*   <b>CY8CKIT-041-41XX PSoC&trade; 4100S CAPSENSE&trade; Pioneer Kit</b></a>
*
* * General Information:
*
*   * <a href="https:/\/cypresssemiconductorco.github.io/mtb-pdl-cat1/pdl_api_reference_manual/html/index.html">
*   <b>CAT1 PDL API Reference</b></a>
*
*   * <a href="https:/\/cypresssemiconductorco.github.io/mtb-pdl-cat2/pdl_api_reference_manual/html/index.html">
*   <b>CAT2 PDL API Reference</b></a>
*
*   * <a href="http:/\/www.cypress.com/an210781"><b>AN210781 Getting Started with
*   PSoC&trade; 6 MCU with Bluetooth Low Energy (BLE) Connectivity</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/technical-reference-manuals/psoc-6-mcu-psoc-63-ble-architecture-technical-reference">
*   <b>PSoC&trade; 6 Technical Reference Manual</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/technical-reference-manuals/psoc-4000s-family-psoc-4-architecture-technical-reference">
*   <b>PSoC&trade; 4000S Family: PSoC&trade; 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="https:/\/www.cypress.com/documentation/technical-reference-manuals/psoc-4100s-and-psoc-4100s-plus-psoc-4-architecture">
*   <b>PSoC&trade; 4100S and PSoC&trade; 4100S Plus: PSoC&trade; 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="http:/\/www.cypress.com/ds218787">
*   <b>PSoC&trade; 63 with BLE Datasheet Programmable System-on-Chip datasheet</b></a>
*
*   * <a href="https:/\/github.com/Infineon"><b> Infineon Technologies GitHub</b></a>
*
*   * <a href="http:/\/www.infineon.com"><b>Infineon Technologies</b></a>
*
* \note
* The links to another software component's documentation (middleware and PDL)
* point to GitHub to the latest available version of the software.
* To get documentation of the specified version, download from GitHub and unzip
* the component archive. The documentation is available in the <i>docs</i> folder.
*
* \defgroup group_capsense_high_level               High-level Functions
*
* \defgroup group_capsense_low_level                Low-level Functions
*
* \defgroup group_capsense_data_structure           Data Structure
*
* \defgroup group_capsense_structures               Structures
* \ingroup group_capsense_data_structure
* \brief The CAPSENSE&trade; structures.
*
* \defgroup group_capsense_gesture_structures       Gesture Structures
* \ingroup group_capsense_data_structure
* \brief The Gesture-related structures.
*
* \defgroup group_capsense_enums                    Enumerated Types
*
* \defgroup group_capsense_macros                   Macros
*
* \defgroup group_capsense_macros_general           General Macros
*   \ingroup group_capsense_macros
*   \brief General macros
* \defgroup group_capsense_macros_mw_state          Middleware State Macros
*   \ingroup group_capsense_macros
*   \brief Middleware state macros
* \defgroup group_capsense_macros_status            Status Macros
*   \ingroup group_capsense_macros
*   \brief Status macros
* \defgroup group_capsense_macros_settings          Settings Macros
*   \ingroup group_capsense_macros
*   \brief Settings macros
* \defgroup group_capsense_macros_pin               Pin-related Macros
*   \ingroup group_capsense_macros
*   \brief Pin-related macros
* \defgroup group_capsense_macros_process           Processing Macros
*   \ingroup group_capsense_macros
